WB/src/Catalogs/КарточкиТоваров/КарточкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КарточкиТоваров</name>
  <owners>Catalog.Продавцы</owners>
  <attributes>
    <name>АртикулWB</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АртикулПродавца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдОбъединеннойКарточки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКодМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМаркировкиНанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Медиафайлы</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыМедиафайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Ид</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ярлыки</name>
    <attributes>
      <name>Ид</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

WB/src/Catalogs/КарточкиТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДанныеAPI = КарточкиТоваровAPI.ПолучитьВсеКарточкиТоваров(Токен);
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("АртикулWB", ДанныеAPI.АртикулWB, , Продавец);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьЭлемент();
		Объект.Владелец = Продавец;
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Наименование = ДанныеAPI.Наименование;
	Объект.АртикулWB = ДанныеAPI.АртикулWB;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
